# J. Два прямоугольника
# Ограничение времени	1 секунда
# Ограничение памяти	64Mb
# Ввод	стандартный ввод или input.txt
# Вывод	стандартный вывод или output.txt
# Недавно один известный художник-абстракционист произвел на свет новый шедевр — картину «Два черных непересекающихся
# прямоугольника». Картина представляет собой прямоугольник m× n, разбитый на квадраты 1× 1, некоторые из которых
# закрашены любимым цветом автора — черным. Федя — не любитель абстрактных картин, однако ему стало интересно,
# действительно ли на картине изображены два непересекающихся прямоугольника. Помогите ему это узнать.
# Прямоугольники не пересекаются в том смысле, что они не имеют общих клеток.
#
# Формат ввода
# Первая строка входного файла содержит числа m и n (1 ≤ m, n ≤ 200). Следующие m строк содержат описание рисунка.
# Каждая строка содержит ровно n символов. Символ «.» обозначает пустой квадрат, а символ «#» — закрашенный.
#
# Формат вывода
# Если рисунок можно представить как два непересекающихся прямоугольника, выведите в первой строке «YES», а в
# следующих m строках выведите рисунок в том же виде, в каком он задан во входном файле, заменив квадраты,
# соответствующие первому прямоугольнику на символ «a», а второму — на символ «b». Если решений несколько,
# выведите любое.
#
# Если же этого сделать нельзя, выведите в выходной файл «NO».
#
# Пример 1
# Ввод
# 2 1
# #
# .
# Вывод
# NO
# Пример 2
# Ввод
# 2 2
# ..
# ##
# Вывод
# YES
# ..
# ab
# Пример 3
# Ввод
# 1 3
# ###
# Вывод
# YES
# abb
# Пример 4
# Ввод
# 1 5
# ####.
# Вывод
# YES
# abbb.

# ok, сдал на C++
